; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_2 ?v7 - type_2 ?v8 - type_3)
 	      (pred_3 ?v2 - object ?v8 - type_3)
	      (pred_4 ?v7 - type_2 ?v4 - type_1)
	      (pred_1 ?v7 - type_2 ?v2 - object ?v4 - type_1))

   (:action op_1
       :parameters  (?v7 - type_2 ?v1 ?v5 - type_3)
       :precondition (and  (pred_2 ?v7 ?v1))
       :effect (and  (pred_2 ?v7 ?v5)
		     (not (pred_2 ?v7 ?v1))))

   (:action op_3
       :parameters (?v7 - type_2 ?v3 - object ?v6 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_3 ?v3 ?v6) (pred_2 ?v7 ?v6) (pred_4 ?v7 ?v4))
       :effect (and (pred_1 ?v7 ?v3 ?v4)
		    (not (pred_3 ?v3 ?v6)) 
		    (not (pred_4 ?v7 ?v4))))

   (:action op_2
       :parameters (?v7 - type_2 ?v3 - object ?v6 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_1 ?v7 ?v3 ?v4) (pred_2 ?v7 ?v6))
       :effect (and (pred_3 ?v3 ?v6)
		    (pred_4 ?v7 ?v4)
		    (not (pred_1 ?v7 ?v3 ?v4)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_09 - type_2
obj_06 obj_08 - type_1
obj_03 obj_07 obj_05 obj_02 - type_3
obj_10 obj_01 obj_04 - object)
(:init
(pred_2 obj_09 obj_05)
(pred_4 obj_09 obj_06)
(pred_4 obj_09 obj_08)
(pred_3 obj_10 obj_05)
(pred_3 obj_01 obj_03)
(pred_3 obj_04 obj_07)
)
(:goal
(and
(pred_3 obj_10 obj_03)
(pred_3 obj_01 obj_05)
(pred_3 obj_04 obj_05)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_09 ?b obj_08))))
)
)

; plan
1. (op_3 obj_09 obj_10 obj_05 obj_06)
   deleted: (pred_3 obj_10 obj_05) (pred_4 obj_09 obj_06)
   added: (pred_1 obj_09 obj_10 obj_06)
   goals met: 0 of 3
2. (op_1 obj_09 obj_05 obj_03)
   deleted: (pred_2 obj_09 obj_05)
   added: (pred_2 obj_09 obj_03)
   goals met: 0 of 3
3. (op_2 obj_09 obj_10 obj_03 obj_06)
   deleted: (pred_1 obj_09 obj_10 obj_06)
   added: (pred_3 obj_10 obj_03) (pred_4 obj_09 obj_06)
   goals met: 1 of 3
4. (op_3 obj_09 obj_01 obj_03 obj_06)
   deleted: (pred_3 obj_01 obj_03) (pred_4 obj_09 obj_06)
   added: (pred_1 obj_09 obj_01 obj_06)
   goals met: 1 of 3
5. (op_1 obj_09 obj_03 obj_05)
   deleted: (pred_2 obj_09 obj_03)
   added: (pred_2 obj_09 obj_05)
   goals met: 1 of 3
6. (op_2 obj_09 obj_01 obj_05 obj_06)
   deleted: (pred_1 obj_09 obj_01 obj_06)
   added: (pred_3 obj_01 obj_05) (pred_4 obj_09 obj_06)
   goals met: 2 of 3
7. (op_1 obj_09 obj_05 obj_07)
   deleted: (pred_2 obj_09 obj_05)
   added: (pred_2 obj_09 obj_07)
   goals met: 2 of 3
8. (op_3 obj_09 obj_04 obj_07 obj_06)
   deleted: (pred_3 obj_04 obj_07) (pred_4 obj_09 obj_06)
   added: (pred_1 obj_09 obj_04 obj_06)
   goals met: 2 of 3
9. (op_1 obj_09 obj_07 obj_05)
   deleted: (pred_2 obj_09 obj_07)
   added: (pred_2 obj_09 obj_05)
   goals met: 2 of 3
10. (op_2 obj_09 obj_04 obj_05 obj_06)
   deleted: (pred_1 obj_09 obj_04 obj_06)
   added: (pred_3 obj_04 obj_05) (pred_4 obj_09 obj_06)
   goals met: 3 of 3
